[
    {
        "title": "Технический специалист по настройке онлайн касс на сайт",
        "salary": "от 60 000 до 85 000 ₽ за месяц, до вычета налогов",
        "company": "ООО Таргенетика",
        "logo": null,
        "description": "Технический специалист (интеграция Яндекс Сплит) / Партнер Яндекса\n\nО компании: Таргенетика — официальный партнер Яндекса (Яндекс Сплит). Мы помогаем бизнесу подключать современные платежные инструменты. Сейчас ищем технического специалиста для работы с входящими лидами.\n\nСуть работы: Менеджер продает клиенту ценность сервиса и договаривается о бесплатной установке. После согласования лид передается вам. Вы связываетесь с клиентом, берете доступы и настраиваете платежную систему на сайте.\n\nОбязанности:\n• Получение лидов от менеджера (клиент уже готов к установке).\n• Самостоятельная связь с клиентом для получения доступов к сайту.\n• Интеграция Яндекс Сплит на сайт клиента (разные платформы).\n\nТребования:\n\n• Понимание устройства сайтов: опыт с конструкторами (Tilda, Readymag и др.) и CMS (WordPress — обязательно).\n• Знание базовых принципов верстки/разработки (чтобы понимать структуру сайта, размещение скриптов).\n• Достаточный уровень коммуникации — уметь объяснить задачу клиенту и договориться о доступах.\n• Внимательность к деталям (работа с платежными системами требует точности).\n• Опыт интеграции любых платежных систем.\n• Навыки PHP/JavaScript для мелких доработок.\n\nУсловия:\n• Полная удаленка, работа из любой точки РБ.\n• Стабильная заработная плата от установок\n• Поток задач стабильный — менеджеры уже закрывают продажи, вы только подключаете.\n\nОткликнуться: Если вы уверенно работаете с разными типами сайтов и готовы к простым, но ответственным задачам — ждем ваш отклик. В сообщении кратко укажите свой опыт с сайтами и CMS.",
        "grade": null,
        "skills": [
            "HTML",
            "JavaScript",
            "Информационные технологии",
            "Интеграция платежных систем",
            "Wordpress",
            "Tilda",
            "Деловая коммуникация",
            "Телефонные переговоры",
            "CSS",
            "Readymag",
            "Умение работать в коллективе"
        ],
        "experience": "1–3 года",
        "url": "https://hh.ru/vacancy/130603175?query=PHP&hhtmFrom=vacancy_search_list",
        "country": "Russia",
        "source": "hh",
        "posted_at": "2026-02-19T00:00:00"
    },
    {
        "title": "PHP-разработчик",
        "salary": "от 120 000 ₽ за месяц, на руки",
        "company": "Теплый дом",
        "logo": "logos/теплый_дом.png",
        "description": "PHP-разработчик (удалённо)\n\nВдохновляющая возможность для тех, кто любит создавать удобные и эффективные CRM-системы!\n\nВам нравится видеть, как ваши решения упрощают работу сотен людей? Хотите влиять на развитие крупной региональной компании и реализовывать интересные задачи в команде профессионалов? Тогда присоединяйтесь к нам!\n\nЧем предстоит заниматься:\n\nРазработка и поддержка внутренних CRM-систем на PHP\nРешение нестандартных задач по автоматизации бизнес-процессов\nИспользование JavaScript для доработки интерфейсов\n\nЧто важно для нас:\n\nУверенное знание PHP и опыт коммерческой разработки от 5 лет\nНавыки работы с JavaScript , HTML, CSS\nГотовность разбираться в чужом коде и предлагать улучшения\nСамостоятельность, ответственность и желание развиваться\n\nУсловия и преимущества:\n\nУдалённая работа с гибким графиком — вы сами выбираете, когда работать\nРеальные перспективы карьерного роста\n\nО компании Компания «Теплый дом» — это более 270 сотрудников, филиалы в трёх городах и амбициозная цель стать лидером рынка стройматериалов. Мы ценим инициативу, поддерживаем развитие каждого и создаём условия для комфортной работы. Присоединяйтесь к нам и станьте частью сильной команды!",
        "grade": null,
        "skills": [],
        "experience": "более 6 лет",
        "url": "https://hh.ru/vacancy/130641092?query=PHP&hhtmFrom=vacancy_search_list",
        "country": "Russia",
        "source": "hh",
        "posted_at": "2026-02-20T00:00:00"
    },
    {
        "title": "Fullstack-разработчик (Yii2, nuxt.js)",
        "salary": null,
        "company": "Fix Price. IT",
        "logo": "logos/fix_price._it.png",
        "description": "Вам предстоит:\n\nРазработка и поддержка внутреннего WEB-приложения;\nПроведение кодревью;\nПроектирование архитектуры.\n\nМы ожидаем:\n\nОпыт работы fullstack-разработчиком от 3-х лет;\nОпыт разработки клиент-серверных WEB-приложений;\nПонимание принципов разработки API;\nОпыт работы с любым бэкенд фреймворком (желательно Yii2) от 2-х лет;\nОпыт работы с nuxt.js;\nЗнание: PHP 8, HTML, JS, CSS, SQL, Linux;\nПонимание SOLID, желателен опыт разработки с DDD;\nСпособность разбираться в чужом коде.\n\nВ наших проектах мы используем: SOA, Docker, Linux, Nginx, Git;\nБэк: PHP8, Yii2, MySQL, Redis, Rabbit, s3;\nФронт (административные интерфейсы): nuxt.js, JQuery;\nПереносим проекты в kubernetes, настраиваем CI/CD (gitlab + kubernetes);\nРазвиваем UI-Kit;\nПишем тесты (codeception, playwright).\n\nМы предлагаем:\n\nРаботу в крупной международной компании;\nОфициальное оформление по ТК РФ;\nПолностью белую заработную плату;\nГрафик: 5/2, гибридный формат работы;\nКомфортный офис в шаговой доступности от м. Проспект Мира (5 минут пешком);\nУютную Food-зону (оборудованную холодильниками, микроволновками, кофемашиной и вендинговым автоматом с готовой едой);\nОтсутствие строгого дресс-кода (smart casual).\n\nДополнительные бонусы:\n\nРабота в дружной команде и развитая корпоративная жизнь;\nВозможность профессионального и карьерного роста, гибкое отношение к новым идеям;\nВозможность повышения квалификации и переподготовки по выбранной специальности в нашем корпоративном университете с получением сертификата или диплома;\nПрограмма ДМС и премиум подписка на медицинской платформе с первого рабочего дня;\nПремиум доступ к платформе со скидками от партнеров;\nПодарки на день рождения;\nРеферальная программа для сотрудников;\nДоплата к больничным и отпускам до полной заработной платы.",
        "grade": null,
        "skills": [],
        "experience": "3–6 лет",
        "url": "https://hh.ru/vacancy/129274890?query=PHP&hhtmFrom=vacancy_search_list",
        "country": "Russia",
        "source": "hh",
        "posted_at": "2026-02-20T00:00:00"
    },
    {
        "title": "PHP-разработчик (Middle+/Senior)",
        "salary": "до 300 000 ₽ за месяц, на руки",
        "company": "Hi, Rockits!",
        "logo": "logos/hi__rockits_.png",
        "description": "Куда:\nПродуктовая IT-компания, разрабатывающая сервис на базе искусственного интеллекта для анализа телефонных переговоров и текстовых коммуникаций. Клиенты — B2B-сегмент, преимущественно отделы продаж и клиентского сервиса.\n\nПродукт работает с реальными бизнес-пользователями и обрабатывает значительные объемы данных. В настоящее время расширяем команду в связи с ростом количества задач, клиентской базы и нагрузкой на системы. Помимо развития текущего продукта, запускаем новые направления, включая разработку голосовых ИИ-ассистентов.\n\nКомпания имеет государственную IT-аккредитацию.\n\nТехнологический стек:\n\nЯзыки и окружение: PHP 8.2 / 8.3\n\nФреймворки: Yii2 (используется как инфраструктурная основа, без жесткой привязки бизнес-логики к фреймворку)\n\nБазы данных: PostgreSQL (работа с индексами, сложными запросами, анализ планов выполнения)\n\nОчереди: PostgreSQL, RabbitMQ\n\nИнфраструктура: Docker (для локальной разработки и тестовых сред), GitLab CI/CD (пайплайны и управление релизами)\n\nПодход к разработке:\n\nБизнес-логика реализуется средствами нативного ООП PHP.\n\nКлючевое требование: понимание архитектурных принципов и инженерных практик. Фреймворк рассматривается как инструмент, а не как основа архитектуры.\n\nФункциональные обязанности:\n\nПроектирование и разработка новых модулей и сервисов.\n\nПроведение рефакторинга и эволюционное улучшение архитектуры существующей кодовой базы.\n\nУчастие в задачах, связанных с AI-направлением: работа с эмбеддингами, векторными представлениями данных, интеграция LLM, реализация базовой логики RAG и взаимодействие со внешними AI-сервисами. Ожидается роль инженера, способного интегрировать и адаптировать AI-компоненты для промышленной эксплуатации, без углубления в задачи ML-исследователя.\n\nОптимизация производительности приложения для работы с возрастающими нагрузками.\n\nРазработка и поддержка интеграций с внешними сервисами через REST API и вебхуки.\n\nУчастие в процессе код-ревью.\n\nДиагностика и устранение инцидентов в продуктивной среде, включая нестандартные сценарии поведения системы.\n\nКвалификационные требования:\n\nКоммерческий опыт разработки на PHP от 6 лет.\n\nГлубокое понимание нативного ООП.\n\nЗнание и применение принципов SOLID и подходов к построению чистой архитектуры.\n\nУверенные навыки написания и оптимизации SQL-запросов (знание синтаксиса, умение анализировать и создавать индексы, читать планы выполнения).\n\nПрактический опыт работы с очередями и построения асинхронных процессов.\n\nПонимание принципов CI/CD и опыт работы с соответствующими инструментами.\n\nВладение Git на уровне, достаточном для выполнения откатов изменений и управления версиями.\n\nОпыт работы с Yii2 будет преимуществом, но не является обязательным. Рассматриваются кандидаты с опытом работы в других MVC-фреймворках, способные адаптироваться к новому инструментарию.\n\nДополнительная информация:\n\nВ компании действуют регламенты по использованию AI-инструментов в разработке, включая правила применения автоматической генерации кода, с условием ответственности разработчика за конечный результат.\n\nСуществует возможность расширения зоны ответственности за счет смежных задач в области интеграции ML-моделей и LLM.\n\nПроцесс отбора:\n\nСкрининговое интервью с HR.\n\nТехническое собеседование с техническим директором / тимлидом.\n\nПринятие решения и направление оффера.\n\nВыход\n\nУсловия работы:\n\nФормат работы: удаленный.\n\nЗанятость: полный рабочий день.\n\nФорма оформления: Трудовой договор по ТК РФ (также возможны альтернативные варианты: ГПХ, самозанятость, ИП).\n\nРабочее время: основная активность команды (разработчики, менеджеры, техподдержка) приходится на интервал с 10:00 до 19:00 по московскому времени. От кандидата ожидается доступность для оперативного взаимодействия и синхронизации в течение большей части этого периода, при этом индивидуальный график может быть гибким.\n\nКонтроль: система учета рабочего времени не используется. Оценка эффективности производится на основе выполнения поставленных задач, соблюдения согласованных сроков и общего уровня ответственности.\n\nОткликайтесь и мы свяжемся с вами!",
        "grade": "Senior",
        "skills": [
            "PHP",
            "PostgreSQL",
            "Yii",
            "Git",
            "RabbitMQ"
        ],
        "experience": "более 6 лет",
        "url": "https://hh.ru/vacancy/130639788?query=PHP&hhtmFrom=vacancy_search_list",
        "country": "Russia",
        "source": "hh",
        "posted_at": "2026-02-20T00:00:00"
    },
    {
        "title": "Middle PHP Developer",
        "salary": "от 130 000 до 180 000 ₽ за месяц, до вычета налогов",
        "company": "Экспортер",
        "logo": "logos/экспортер.png",
        "description": "Компания Экспортер — международная торгово-сервисная компания.\nЗанимаемся экспортом и импортом товаров со странами Таможенного Союза с 2011 года. Офисы нашей компании находятся в Казахстане, России и Киргизии.\n\nМы строим международный маркетплейс для бизнеса. Проект находится в активной фазе формирования.\n\nУже есть:\n\nБизнес-видение и дорожная карта на 8 спринтов\n\nТехнический лидер разработки/Архитектор проекта\n\nИнтеграционный контур: 1С (УТ/БП, Казахстан), Bitrix24 (коробочная версия), шина на Kafka (планируется)\nВ настоящий момент приглашаем в команду Middle PHP Developer\n\nОбязанности:\n\n1. Реализация API-методов и задач для планировщика, согласно ТЗ\n2. Исправление багов\n3. Создание UnitTest-ов\n4. Написание документации на Swagger\n\nТребования:\n- Опыт работы в качестве PHP разработчика от 3 лет;\n- Коммерческий опыт работы на Symfony или Yii2 от 3 лет;\n- Знание PostgreSQL;\n- Базовые навыки использования Docker, сред контейнеризации;\n- Опыт работы с брокером сообщений Kafka;\n- Опыт интеграции с внешними сервисами;\n- Опыт работы с REST API\nУсловия:\n\nЗарплата 130-180тыс на руки, оформление обсуждается\nВозможность работать в офисе или удаленно",
        "grade": "Middle",
        "skills": [],
        "experience": "3–6 лет",
        "url": "https://hh.ru/vacancy/130637102?query=PHP&hhtmFrom=vacancy_search_list",
        "country": "Russia",
        "source": "hh",
        "posted_at": "2026-02-20T00:00:00"
    },
    {
        "title": "Senior front-end developer",
        "salary": "от 320 000 ₽ за месяц, на руки",
        "company": "ООО МАКСБИТСОЛЮШЕН",
        "logo": null,
        "description": "MAXBITSOLUTION - IT-компания, создающая проекты в сфере iGaming. Мы разрабатываем высоконагруженные системы с использованием Ruby on Rails, Vue.js, Nuxt, React, PHP и Go, а также управляем трафикообразованием и лидогенерацией.\nКакие продукты мы создаем? Крупные развлекательные онлайн-проекты и приложения для iOS и Android.\n\nМИНИМАЛЬНЫЙ требуемый опыт разработки от 6-ти лет!!!\n\nЧем предстоит заниматься:\n\nулучшением производительности своего проекта;\nразработкой пользовательских интерфейсов на Vue/React;\nпроектированием архитектурных решений новых сервисов, библиотек;\nинтеграцией с Back-end;\nвзаимодействием с менеджерами, дизайнером, back-end разработчиками, QA-инженерами;\nконтролем качества кода, code-review, написанием тестов;\nоптимизацией производительности SPA-проектов;\nподдержанием клиентских и внутренних проектов компании.\n\nНам нужен именно ты, если у тебя есть:\n\nопыт работы с react, react-router, redux, redux-saga, SASS, TypeScript;\nопыт работы Jest, Performance API, Web Workers;\nумение выстраивать модели и потоки данных на TypeScript;\nпонимание и опыт работы c монолитной и микросервисной архитектурой;\nналичие опыта по созданию и поддержке Toolkit-компонентов;\nумение отличать плохой код от хорошего.\n\nБудет весомым преимуществом:\n\nопыт работы тимлидом;\nсамостоятельность и вовлеченность в долгосрочный процесс разработки;\nумение писать красивый, эффективный и поддерживаемый код в соответствии со style guide;\nумение различать хорошие решения от плохих.\n\nНаш стек:\nTypescript, Nuxt 4, Vue 3, React, Redux, Pinia, Vite, Webpack, Lerna, GitLab.\n\nМы предлагаем:\n\nработа в 10:00 до 19:00 по МСК (УДАЛЕНКА);\n\nбезграничные возможности для профессионального роста и самореализации;\n\nсовременное техническое оснащение (мощное железо, дополнительные мониторы, и все, что нужно для работы);\n\n3 sick days;\n\nкомпенсация спорта после прохождения испытательного срока;\n\nинтересные корпоративные мероприятия;\n\n*вакансия на перспективу.\n\nМы уверены, что после технического интервью вы захотите в нашу команду!",
        "grade": "Senior",
        "skills": [
            "JavaScript",
            "React",
            "Redux"
        ],
        "experience": "более 6 лет",
        "url": "https://hh.ru/vacancy/129282193?query=PHP&hhtmFrom=vacancy_search_list",
        "country": "Russia",
        "source": "hh",
        "posted_at": "2026-02-20T00:00:00"
    },
    {
        "title": "Программист 1С-Битрикс на FoodTech проект",
        "salary": "от 150 000 до 220 000 ₽ за месяц, до вычета налогов",
        "company": "Ameton",
        "logo": "logos/ameton.png",
        "description": "Мы — компания «Аметон». Небольшой digital-production с ламповой атмосферой. 8 лет создаём и поддерживаем e-commerce проекты.\n\nСейчас мы в поисках 1С-Битрикс разработчика уровня middle для работы над проектом “ВкусВилл”\n\nТекущий состав команды проекта состоит из: 1 Team Lead, 4 backend, 3 frontend, 2 QA, 3 Project-manager, 1 DevOps.\n\nКак мы работаем:\n\nРаботаем недельными спринтами;\n\nвыделенный на команду профессиональный Project-менеджер, который помогает делать задачи, а не мешает;\n\nзадачи ведём в Yandex.Tracker;\n\nу нас нет тайм-трекеров, записи экранов и т.д. У нас работают только ответственные разработчики, которые сами все релизят в срок;\n\nнет бюрократии и бесконечных митингов, но общаться в общих чатах с внутренними заказчиками проекта надо.\n\nЧто предстоит делать:\n\nРаботать в команде с backend разработчиками, Devops, frontend разработчиками, project и product менеджерами, QA инженерами;\n\nПисать код, высказывать и предлагать идеи и пути решения задач.\n\nТехнологический стек:\n\nPHP8;\n\njQuery;\n\nVue.js;\n\nMySQL;\n\nApache, Nginx;\n\ngitlab;\n\nBitrix D7.\n\nТребования:\n\nОпыт от 3 лет в веб-разработке;\n\nНаличие завершенных, работающих ecommerce-проектов;\n\nПонимание чужого кода, внимательность и критическое мышление;\n\nЖелание развиваться и изучать новые технологии;\n\nЗнание Bitrix API и опыт работы с D7 (на уровне написания своих модулей, компонентов);\n\nОпыт взаимодействия с разнообразными сервисами по API;\n\nОпыт работы с Git;\n\nУмение предложить (и обосновать) рациональные решения поставленных задач;\n\nУмение работать с Legacy-кодом (успешный опыт рефакторинга);\n\nЖелание лидировать и развиваться;\n\nПонимание HTML5/CSS3 (верстки мало, но бывает необходимость);\n\nОпыт работы в команде;\n\nМы предлагаем:\n\nДолговременную, стабильную работу;\n\nИнтересные, нестандартные задачи (но рефакторинг тоже будет);\n\nОформление в соответствии с ТК РФ;\n\nПолностью удаленная работа с 8 до 17 по MSK\n\nИнтересные и сложные продуктовые задачи, а не поддержка очередного сайта на Bitrix\n\n28 дней оплачиваемого отпуска в году;\n\nПолностью удаленный формат работы из любой точки мира\n\nКак будет проходить отбор успешного кандидата на позицию:\n\nВстреча-знакомство: обсудим знание технологий php, mysql, bitrix, блок с задачами, которые мы предложим выполнить в формате live code\n\nОбратная связь\n\nВыполнение тестового задания\n\nОбсуждение тестового задания, оффер",
        "grade": null,
        "skills": [
            "PHP",
            "MySQL",
            "XML",
            "API",
            "Bitrix",
            "1С-Битрикс",
            "jQuery",
            "HTML",
            "PHP5"
        ],
        "experience": "1–3 года",
        "url": "https://hh.ru/vacancy/130079343?query=PHP&hhtmFrom=vacancy_search_list",
        "country": "Russia",
        "source": "hh",
        "posted_at": "2026-02-20T00:00:00"
    },
    {
        "title": "Senior backend",
        "salary": "от 200 000 до 250 000 ₽ за месяц, на руки",
        "company": "Экспортер",
        "logo": "logos/экспортер.png",
        "description": "Компания Экспортер — международная торгово-сервисная компания.\nЗанимаемся экспортом и импортом товаров со странами Таможенного Союза с 2011 года. Офисы нашей компании находятся в Казахстане, России и Киргизии.\n\nМы строим международный маркетплейс для бизнеса. Проект находится в активной фазе формирования.\n\nУже есть:\n\nБизнес-видение и дорожная карта на 8 спринтов\n\nТехнический лидер разработки/Архитектор проекта\n\nИнтеграционный контур: 1С (УТ/БП, Казахстан), Bitrix24 (коробочная версия), шина на Kafka (планируется) В настоящий момент приглашаем в команду ведущего разработчика\n\nОбязанности:\n\n1. Оценка задач, участие в обсуждениях с фронтенд-разработкой\n2. Реализация ответственных участков по регистрации пользователей, основных интеграций с Bitrix24 и 1С, проведения сделок, админки\n3. Следить за чистотой кода и отсутствием костылей\n4. Написание UnitTest-ов\n5. Проведение код-ревью\n\nТребования:\n\n- Опыт коммерческой разработки на PHP не менее 6 лет\n- Знание особенностей PHP 8.3\n- Уверенные знания фреймворков Symfony или Yii2\n- Разумное применение на практике паттернов SOLID, YAGNI, DRY, KISS\n- Опыт разработки REST API\n- Опыт разработки WebSocket, желательно знание gRPS и Protobuf\n- Обязателен опыт работы с Kafka\n- Опыт работы с PostgreSQL, умение оптимизировать запросы\n- Опыт разработки на Go или NodeJS\n- Уметь пользоваться Postman\n- Документирование в формате OpenAPI 3 в Swagger или StopLight\n- желателен опыт интеграций с Bitrix24 и 1С\n\nУсловия:\nЗарплата 200-250тыс на руки, оформление обсуждается\nВозможность работать в офисе или удаленно",
        "grade": "Senior",
        "skills": [],
        "experience": "3–6 лет",
        "url": "https://hh.ru/vacancy/130634681?query=PHP&hhtmFrom=vacancy_search_list",
        "country": "Russia",
        "source": "hh",
        "posted_at": "2026-02-20T00:00:00"
    }
]