[
    {
        "title": "Senior Fullstack Developer (Chessable & Courses)",
        "company": "Chess.com",
        "skills": [],
        "description": "<p>Chessable is leading chess e-learning platform using innovative technology to support chess players and authors. It is part of <a href=\"http://chess.com/\" target=\"_blank\">Chess.com</a> - #1 platform for playing, learning, and enjoying chess.<br></p><p><a href=\"http://chess.com/\" target=\"_blank\">Chess.com</a> is a team of 600+ fully remote people in 60+ countries working hard to serve the global chess community. We are here to support 200M+ chess players worldwide with the best possible product, content, and tools to serve the community!<br></p><p>We are a tech company. A gaming company. A content company. And we do it all with passion and commitment to the game. Above all we prize our mission-driven, flat, life-celebrating, no-corporate culture, and we look forward to meeting you and learning more about what you can bring to the team.<br></p><h3><strong>About You</strong></h3><p>You are an experienced full-stack engineer with practical knowledge of how to build, release and maintain applications for millions of users. You understand all layers of the stack from infra + databases → devops → backend → frontend. &nbsp;You have internalized best practices and patterns that allow you to deliver value with quality and velocity.<br></p><p>You evolved beyond traditional development into an AI-first engineering mindset. While your foundation is built on deep practical understanding of software and production systems, you are highly skilled at agentic orchestration. &nbsp;You have integrated agents into your core workflow, supervising them to focus on high-impact architectural decisions, security, and scalability. You understand that clean code and design patterns aren't just for human readability - they are essential for maintaining clear context and an AI-friendly codebase.<br></p><p>You are a team player willing to share your wisdom and creativity with the group of talented and kind people like you. You love coding and building software for fun. You played chess or want to try to play chess.<br></p><p></p><h3><strong>About our code and infrastructure</strong></h3><ul role=\"list\"><li><strong>PHP 7.4+ </strong>and <strong>PHP 8.3+ </strong>for majority of our backend code (<strong>Slim </strong>and<strong> Symfony</strong> frameworks)</li><li><strong>TypeScript </strong>/<strong> JavaScript </strong>(<strong>React</strong>,<strong> Vue.js</strong>,<strong> </strong>some<strong> jQuery 🙈</strong>) for frontend implementations</li><li><strong>MySQL</strong></li><li><strong>Elastic Search</strong></li><li><strong>Redis</strong></li><li><strong>RPC </strong>and<strong> REST </strong>for API communication, <strong>Kafka </strong>as a cross-service bus, RabbitMQ for internal queuing, <strong>Websockets</strong> for some special use-cases</li><li><strong>Docker / Orbstack, Kubernetes, ArgoCD</strong></li><li><strong>PHPStan, Psalm, PHPUnit, Playwright, PHPCSFixer </strong>for ensuring the stability and great developer experience</li><li><strong>Git </strong>pushing your code to <strong>Bitbucket </strong>and<strong> GitHub</strong></li><li><strong>Kibana</strong>,<strong> Sentry</strong>,<strong> DataDog</strong>,<strong> Stackify</strong>,<strong> Blackfire </strong>for observability and performance profiling</li><li><strong>Cursor </strong>/<strong> Claude </strong>/<strong> Junie </strong>for supporting your day to day operations with unlimited agents<br></li></ul><h3><strong>What you'll do</strong></h3><p>You will work with a team of experienced engineers on building new and maintaining existing functionalities. You will contribute to the decisions around technology and architecture of new solutions. You will have fun meeting awesome mission-driven people. You will grow Chess.<br></p><p></p><h3><strong>Preferred skills &amp; experience</strong></h3><ul role=\"list\"><li>Experience with PHP 7.4+ with at least two popular PHP frameworks</li><li>Experience with MySQL or another relational database</li><li>Experience with ElasticSearch, SOLR, MongoDB or any other popular NoSQL database</li><li>AI-first mindset &amp; Prompt Engineering</li><li>API-first design &amp; proficiency in architecting RPC, RESTful or GraphQL APIs</li><li>Familiarity with message brokers like Kafka, RabbitMQ, Redis Pub/Sub or Amazon SQS</li><li>Performance profiling &amp; code debugging, familiarity with tools like XDebug or Blackfire</li><li>CI/CD orchestration - understanding how to bake automated testing and static analysis (PHPStan / Psalm) into deployment pipeline</li><li>Understanding of programming good practices and design patterns</li><li>Strong collaboration and communication skills working in a fully distributed team</li><li>Sense of ownership and responsibility</li><li>Chess player</li><li>Lifelong learner<strong>‍</strong></li></ul><h3>‍<strong>About the Opportunity</strong><br></h3><ul role=\"list\"><li>This is a full-time opportunity</li><li>We are 100% remote (work from anywhere!)</li></ul>",
        "logo": "logos/chess.com.png",
        "url": "https://www.remocate.app/jobs/senior-fullstack-developer-chessable-courses",
        "source": "remocate",
        "country": "🌎 World",
        "posted_at": "2026-02-17T13:17:56.307379"
    },
    {
        "title": "Senior Security Engineer (Python, WordPress & PHP)",
        "company": "CloudLinux",
        "skills": [],
        "description": "<p>We are looking for a <strong>Senior Security Engineer</strong> who understands exploitation deeply but prefers building tooling and automation over one-off research. You will work on systems that:</p><ol role=\"list\"><li>Automatically generate and validate exploit PoCs for known WordPress / PHP CVEs</li><li>Analyze PHP execution traces from real zero-day attacks against WordPress installations<br></li></ol><p>LLMs are a first-class component of this work—not a novelty—used to accelerate exploit reconstruction, PoC generation, and attack workflow automation.</p><p>This is an <strong>engineering role with offensive depth</strong>, not a traditional pentesting or red-team position.</p><h3>What You’ll Build</h3><ul role=\"list\"><li>Systems to ingest, normalize, and analyze PHP execution traces:<ul role=\"list\"><li>Function calls, parameters, control flow, side effects</li><li>No native binary reversing — focus is PHP-level execution and logic</li></ul></li><li>Tooling that infers:<ul role=\"list\"><li>vulnerable code paths</li><li>authorization and logic flaws</li><li>nonce and state-handling weaknesses</li></ul></li><li>Automated pipelines that:<ul role=\"list\"><li>convert CVE descriptions + PHP source code into working PoCs</li><li>replay inferred exploit paths deterministically</li></ul></li><li>LLM-assisted frameworks for:<ul role=\"list\"><li>exploit skeleton generation</li><li>parameter and payload inference</li><li>exploit mutation and robustness testing</li></ul></li><li>High-fidelity exploit simulations targeting:<ul role=\"list\"><li>admin-ajax.php</li><li>WordPress REST APIs</li><li>plugin-specific endpoints</li></ul></li><li>Infrastructure that transforms exploit mechanics into signals usable by detection and prevention systems.</li></ul><h2>Requirements</h2><p><strong>Must have:</strong></p><ul role=\"list\"><li>Strong background in <strong>security engineering or offensive security automation.</strong></li></ul><ul role=\"list\"><li>Hands-on experience exploiting<strong> WordPress plugins, themes, or PHP applications.</strong></li><li>Deep understanding of:<ul role=\"list\"><li>PHP execution model and request lifecycle</li><li>WordPress internals (nonces, hooks, REST, admin flows)</li><li>HTTP semantics, sessions, cookies, and authorization</li></ul></li><li>Proven ability to read, reason about, and exploit <strong>PHP source code</strong>.</li><li>Strong<strong> Python engineering skills </strong>for building:<ul role=\"list\"><li>automation pipelines</li><li>analysis tooling</li><li>exploit frameworks</li></ul></li></ul><p><strong>Nice to have:</strong></p><ul role=\"list\"><li>Exploit framework usage experience like, MSF, Core Impact, Immunity Canvas.</li><li>Prior experience using <strong>LLMs to automate exploit development:</strong> <br><ul role=\"list\"><li>PoC generation</li><li>workflow automation</li><li>payload mutation or inference</li></ul></li><li>Experience with:<ul role=\"list\"><li>execution traces or application-level call graphs</li><li>fuzzing or vulnerability discovery pipelines</li></ul></li><li>Familiarity with tools like: WPScan, Nuclei, Metasploit, Burp.</li><li>Contributions to exploit tooling, frameworks, or security automation.</li><li>Public CVEs or PoCs (helpful but not required)<br><br></li></ul><h3><strong>What This Role Is Not:</strong></h3><ul role=\"list\"><li>Manual pentesting or report-driven consulting</li><li>SOC or alert-triage work</li><li>Pure vulnerability research without automation<br></li></ul><p>This role is about <strong>engineering systems that scale exploitation knowledge.</strong></p><h3>Why This Role Is Interesting</h3><ul role=\"list\"><li>You’ll work with real zero-day attack telemetry, not just public CVEs.</li><li>You’ll build repeatable systems, not one-off demos.</li><li>LLMs are used pragmatically, as part of production pipelines.</li><li>Your work directly shapes how real WordPress attacks are detected and stopped.</li><li>High autonomy, deep technical ownership.</li></ul><h3>Benefits</h3><p><strong>What's in it for you?</strong></p><ul role=\"list\"><li>A focus on professional development.</li><li>Interesting and challenging projects.</li><li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide.</li><li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves.</li><li>Compensation for private medical insurance.</li><li>Co-working and gym/sports reimbursement.</li><li>Budget for education.</li><li>The opportunity to receive a reward for the most innovative idea that the company can patent.</li></ul>",
        "logo": "logos/cloudlinux.png",
        "url": "https://www.remocate.app/jobs/senior-security-engineer-python-wordpress-php",
        "source": "remocate",
        "country": "🇪🇺 Europe",
        "posted_at": "2026-02-15T13:18:00.944627"
    },
    {
        "title": "Senior Frontend Developer",
        "company": "Zendrop",
        "skills": [],
        "description": "<p>This role is fully remote. We are open to candidates anywhere. Our dev team is mainly spread across EMEA and works in European time zones.<br></p><h3><strong>About Zendrop:</strong></h3><p>Zendrop is a fast-growing US-based dropshipping platform that helps entrepreneurs easily start and scale their online stores. Thousands of merchants use our tools to streamline logistics, improve customer experience, and grow revenue.</p><p>At Zendrop we move fast, take ownership, and care deeply about results. Our core values — <strong>Speed Over Perfection</strong>, <strong>Results Driven</strong>, and <strong>Extreme Ownership</strong> guide every decision we make.</p><p>We act quickly and focus on what truly moves the needle. We’re driven by outcomes, not checkboxes, and we take full responsibility from start to finish. Every team member has the autonomy to make an impact and the accountability to see it through.</p><p>If you’re someone who thrives in a fast-paced, high-ownership environment where progress matters more than perfection, you’ll fit right in.</p><h3><strong>Description </strong>‍</h3><p>We're looking for a <strong>Senior Frontend Developer</strong> to join our engineering team and help us modernize and scale our merchant-facing applications. You'll work on our ongoing Vue 2 → Vue 3 migration, build new features, and help shape how we integrate AI-assisted development into our workflows.</p><p>This isn't a role where you'll be writing boilerplate all day. We expect you to leverage modern AI coding tools (Cursor, Claude, etc.) to move faster and focus on solving real problems. If you're already using these tools daily — great. If not, you should be eager to learn.<br></p><p>The project: <a href=\"https://zendrop.com/\"><strong>https://zendrop.com/</strong></a></p><p>«We are more interested in bright developers with aspirations and burning desire to work, than in specific skills.»<br></p><h3><strong>What You'll Do</strong></h3><ul role=\"list\"><li>Build and maintain features in our Vue 3 application (with some Vue 2 legacy work)</li><li>Collaborate with backend (Laravel) and product teams to ship merchant-facing functionality</li><li>Contribute to our component library and Storybook documentation</li><li>Write clean, maintainable code — whether you or an AI agent wrote the first draft</li><li>Participate in code reviews with an eye for quality, not just syntax</li><li>Help us figure out the right balance between AI-assisted speed and code quality </li></ul><h3><strong>Tech Stack</strong></h3><ul role=\"list\"><li>Frontend: Vue 3, Pinia, Vue Router, Vuelidate, Axios</li><li>Styling: Sass, Tailwind</li><li>Build: Laravel Mix, Webpack</li><li>Documentation: Storybook 8.x</li><li>Legacy: Vue 2, Vuex, Bootstrap-Vue<br></li></ul><h3><strong>What We're Looking For</strong></h3><ul role=\"list\"><li>3+ years of experience with Vue.js (Vue 3 preferred, Vue 2 acceptable)</li><li>Solid JavaScript/TypeScript fundamentals — you understand what the AI-generated code actually does</li><li>Experience with state management (Pinia or Vuex)</li><li>Comfortable working with REST APIs</li><li>Familiarity with component-driven development and design systems</li><li>Ability to read and improve existing code, not just write new code</li><li>English level B2+ (our team communicates in English)<br></li></ul><p><strong>Nice to Have</strong></p><ul role=\"list\"><li>Experience with Laravel or PHP backends</li><li>Familiarity with e-commerce platforms (Shopify, Clickfunnels, fulfillment systems)</li><li>Experience migrating legacy codebases</li><li>Already using AI coding assistants effectively in your workflow</li><li>Fluency in Russian (written and spoken) is a strong plus<br></li></ul><h3><strong>Our Take on AI Tools</strong></h3><p>We're pragmatic about AI-assisted development. These tools are productivity multipliers when used well, but they don't replace engineering judgment. We expect you to:</p><ul role=\"list\"><li>Use AI tools to accelerate repetitive work and explore solutions faster</li><li>Review and understand AI-generated code before committing it</li><li>Know when to use AI and when to think through a problem yourself</li><li>Help us develop team practices around AI-assisted development<br></li></ul><h3><strong>Benefits</strong></h3><ul role=\"list\"><li>Unlimited PTO</li><li>Career development and growth opportunities</li><li>A collaborative and inclusive work environment</li><li>Opportunity to shape our frontend architecture during a key transition period<br></li></ul><h3><strong>The Interview Process</strong>‍</h3><ul role=\"list\"><li>Intro conversation with our HR Manager</li><li>Conversation with our Frontend Tech Lead and CTO</li><li>Conversation with our Co-Founder / CTO of our parent company<br></li></ul><p><strong>We look forward to speaking with you! </strong></p>",
        "logo": "logos/zendrop.png",
        "url": "https://www.remocate.app/jobs/senior-frontend-developer-13",
        "source": "remocate",
        "country": "🌎 World",
        "posted_at": "2026-02-07T13:18:05.265298"
    },
    {
        "title": "Junior Wordpress Fullstack Developer",
        "company": "EfficientVision",
        "skills": [],
        "description": "<p><strong>This is a remote position.</strong></p><h3>Job Description</h3><ul role=\"list\"><li>Develop and maintain WordPress websites from concept through deployment.<br></li><li>Build responsive, pixel-perfect websites from Figma designs.<br></li><li>Customize and extend themes using page builders such as Elementor.<br></li><li>Optimize websites for speed, performance, and SEO best practices.<br></li><li>Implement robust security measures and manage WordPress updates and backups.<br></li><li>Ensure websites are ADA-compliant and meet WCAG accessibility standards.<br></li><li>Configure and manage caching solutions (e.g., WP Rocket, W3TC).<br></li><li>Troubleshoot and debug issues across the front-end and back-end.<br></li><li>Collaborate with designers, content creators, and project managers.<br></li></ul><h3>Requirements</h3><ul role=\"list\"><li>1-2 years of experience in WordPress development (full-stack).<br></li><li>Proficient in PHP, HTML, CSS, JavaScript, and REST API.<br></li><li>Extensive experience with Elementor and other major page builders.<br></li><li>Solid understanding of WordPress security, performance tuning, and caching.<br></li><li>Proven ability to create pixel-perfect layouts from Figma designs.<br></li><li>Experience with accessibility (ADA/WCAG) and responsive design.<br></li><li>Familiarity with tools like Git, cPanel, and deployment pipelines.<br></li><li>Strong problem-solving skills and attention to detail.</li></ul>",
        "logo": "logos/efficientvision.png",
        "url": "https://www.remocate.app/jobs/junior-wordpress-fullstack-developer",
        "source": "remocate",
        "country": "🌎 World",
        "posted_at": "2026-02-04T13:18:06.548618"
    },
    {
        "title": "Database Engineer",
        "company": "EXADS",
        "skills": [],
        "description": "<p>EXADS is a young international startup specializing in the ad tech industry. Proudly part of EXOGROUP, a set of companies made of 200+ very talented individuals with offerings across a wide range of services in the digital business, with headquarters in Barcelona and offices in Dublin, Porto and Valencia.</p><p>As a company, we actively develop and improve our own proprietary ad-serving technology platform and custom-built infrastructure enabling us to innovate and deploy new features and functionality quickly in a fast-moving and demanding industry.</p><p>We are revolutionizing the online ad-serving industry for advertisers, publishers, and networks alike and are seeking to recruit highly skilled and talented people to join the team to further design, build and scale our platform offerings across a wide range of web and mobile projects which utilize modern technologies such as Data Streaming, Big Data, and Real-Time Statistics Computation and enjoy a work-life balance, supportive and friendly environment.</p><h3><strong>Location</strong></h3><p>Even though you are welcome to work from our office in Porto, this position can be fulfilled from anywhere in Portugal.</p><h3><strong>Your Responsibilities:</strong><br></h3><ul role=\"list\"><li>Manage and monitor ClickHouse database clusters;</li><li>Manage and monitor MariaDB database systems;</li><li>Ensure system reliability and stability over time;</li><li>Ensure the best cost-effective and efficient use of resources;</li><li>Work together with development teams to design, implement and maintain databases based on end-user requirements;</li><li>Regularly review and work towards improving database systems’ design;</li><li>Research performance bottlenecks and suggest solutions to resolve concerns;</li><li>Contribute to team process improvements adhering to industry best practices and principles;</li><li>Participate in team knowledge sharing activities;</li></ul><h3><strong>You have: </strong></h3><ul role=\"list\"><li>Proven experience with MySQL/MariaDB administration;</li><li>Experience in diagnosing, analyzing, and resolving operational problems;</li><li>Experience in database performance analysis and fine-tuning;</li><li>Knowledge about partitioning and sharding of data;</li><li>Exposure to Agile methodologies and related management tools (JIRA, Confluence);</li><li>Excellent written, spoken, and interpersonal communication skills;</li><li>Desired exposure to programming languages such as PHP, Python and Go;</li><li>Previous experience with BigData systems (Hadoop, Impala, ClickHouse) is considered a big plus.</li><li>BS / MS in Computer Science / related technical discipline OR equivalent experience.</li></ul><h3><strong>What you’ll find working at EXADS</strong></h3><p>We offer you a position in a young, dynamic and international environment with the opportunity for regular training, personal development, ambitious career growth, and a competitive salary.</p><p>Most of all, we offer a position in a team that thrives on achievement, success, and leadership within our industry. Our core company value is innovation: where people and creativity drive innovative technology. If you have a passion for developing software and enjoy working in a fast-paced, challenging but rewarding environment, this position is for you! </p><h3><strong>Experience our benefits</strong></h3><ul role=\"list\"><li>Flexible start times;</li><li>Private health insurance</li><li>Remote work from home </li><li>Home office set up budget of 500 Euros</li><li>Your Birthday off as a paid holiday</li><li>Access to quality trainings through Udemy platform</li><li>Additional internal and external trainings through our EXOGROUP University program</li><li>Up to 1500 Eur of training budget and 5 days of study leave, every year</li><li>Spanish, English, and Portuguese language lessons;</li><li>Employee referral program bonus - Earn 2500 Euros by referring someone!</li><li>Subsidised Well Being Activities</li><li>Exciting team buildings in locations such as Ibiza</li><li>Calm App subscription</li><li>Office Perks</li><li>Meal card</li><li>Relocation Package</li></ul>",
        "logo": "logos/exads.png",
        "url": "https://www.remocate.app/jobs/database-engineer",
        "source": "remocate",
        "country": "🇵🇹 Portugal",
        "posted_at": "2026-02-02T13:18:12.577528"
    },
    {
        "title": "Software Engineer (Golang / PHP)",
        "company": "ZiMAD",
        "skills": [],
        "description": "<p>Are you passionate about your work and want to pursue your dreams?</p><p>Join the ZiMAD team, and let’s collaborate to create exceptional games together!</p><p>ZiMAD, a leading mobile game developer and publisher based in Florida, is on a mission to expand its successful mobile game portfolio to the web. By porting its popular mobile titles to online platforms, ZiMAD aims to attract new users, monetize them effectively, and, most importantly, guide them back to its mobile properties for a seamless cross-platform experience.</p><p>We’ve forged partnerships with internationally renowned IPs (like Disney, Nickelodeon, LIFE, Sony Pictures etc.) and strive to develop games that sharpen mental well-being and deliver remarkable user experiences.</p><h3>About the Role</h3><p>We are looking for a Golang/PHP Software Engineer to work on infrastructure projects for our mobile games, including an in-game analytics platform and backend services that power core game features. </p><p>In this role, you will build internal tools using Golang and ClickHouse for game and marketing analytics – such as systems for managing A/B tests and processing event data from game clients and MMP services (e.g., AppsFlyer). </p><p>You will also support and further develop existing backend solutions written in PHP with PostgreSQL, including player profiles, in-game events, and other core backend functionality. </p><h3><strong>Essential Duties and Responsibilities:</strong></h3><ul role=\"list\"><li>Design, develop, and maintain internal services and infrastructure using Golang and PHP.</li><li>Work with ClickHouse and PostgreSQL to design schemas, write efficient queries, and optimize database performance.</li><li>Design and maintain REST APIs and internal interfaces for game systems, analytics tools, and third-party integrations.</li><li>Monitor and optimize backend services to resolve performance bottlenecks and improve resource usage. </li><li>Participatein architectural discussions and decision-making to improve the modularity, scalability, and maintainability of backend components. </li></ul><h3><strong>Our Stack:</strong></h3><ul role=\"list\"><li>Golang, PHP, ClickHouse, PostgreSQL, Redis, Kafka. </li><li>Knowledgeof React.JS and MySQL will be an additional plus. </li></ul><h3><strong>Qualifications:</strong></h3><ul role=\"list\"><li>3+ years of professional experience in backend or software development using Golang and PHP.</li><li>Experience with ClickHouse and PostgreSQL (+proficiency in writing optimized SQL queries). </li><li>Good understanding of system design principles, including scalability, fault tolerance, queues, caching, transactional consistency, and API contracts.</li><li>Experience with high-load or data-intensive systems and basic performance optimization.</li><li>Ability to work independently on tasks and take responsibility for delivered solutions.</li><li>Good communication skills and ability to collaborate with cross-functional teams.<br></li></ul><p><strong>Would Be a Great Addition:</strong></p><ul role=\"list\"><li>Experience working with analytics or event-based systems (event tracking, logging, metrics, funnels, A/B testing, etc.).</li><li>Experience in the integration of MMP services (e.g., AppsFlyer or Adjust) or in development for ad/marketing analytics.</li><li>Background in backend development for mobile games.</li><li>Basic knowledge of distributed systems, queues, or message brokers.</li></ul><h3><strong>What we offer:</strong></h3><ul role=\"list\"><li>Opportunity to work for ZiMAD, a US company with a diverse portfolio of global free-to-play (F2P) projects with a multi-million monthly user base</li><li>Involvement in the entire product development cycle</li><li>Career growth prospects within an international company</li><li>Remote work opportunities</li><li>Flexible working schedule</li><li>Bonuses based on the achievement of KPIs and financial results of projects</li><li>Paid conferences, training (including language courses), and workshops</li><li>Opportunity to have sessions with psychologists to improve your mental health and well-being</li><li>Participation in charity projects</li></ul>",
        "logo": "logos/zimad.png",
        "url": "https://www.remocate.app/jobs/software-engineer-golang-php",
        "source": "remocate",
        "country": "🌎 World",
        "posted_at": "2026-01-31T13:18:15.328754"
    },
    {
        "title": "Backend Developer",
        "company": "Mediacube",
        "skills": [],
        "description": "<p>Our IT Department is looking for a Backend Developer<br></p><h3>What are you going to do?</h3><ul role=\"list\"><li>Develop and integrate new services;</li><li>Moving through the roadmap with a clearly defined mission;</li><li>Create modern web applications using Laravel;</li><li>Work in a distributed team of professionals.<br></li></ul><h3>You are perfect for us if:</h3><ul role=\"list\"><li>2 years of PHP development experience;</li><li>Strong knowledge of Laravel, git, and PostgreSQL;</li><li>Writing unit and integration tests;</li><li>Experience working in a Linux environment;</li><li>Basic knowledge of WebSockets, redis;</li><li>Understanding and good adaptation to other people's code;</li><li>Advanced soft skills: easygoing, communicative, desire to learn new things and develop, ability to work in a team.<br></li></ul><h3>What we offer:</h3><ul role=\"list\"><li>You can work from anywhere in the world;</li><li>Medical allowance;</li><li>Mentorship by experienced colleagues;</li><li>25 days of paid vacation;</li><li>5 sick days;</li><li>Coworking allowance;</li><li>Professional training, courses and lectures;</li><li>English classes;</li><li>And much more<br></li></ul><h3>What MediaCube does</h3><p>Mediacube helps creators manage their money comfortably, quickly, and safely. Over 10 years of work, we have built a whole ecosystem with services and apps for YouTube and Facebook authors and musicians. And at the center of this system is our own MC Pay app. Our products are pioneers in fintech for creators. Our team has thought through everything to the smallest detail and created all the conditions for convenient and technologically advanced money management.<br></p><h3>Our culture</h3><p>At Mediacube, our employees are the core of our success. We embrace proactivity, encouraging initiative, and value transparency through open communication and honest feedback. Our teamwork culture fosters mutual support, respect, and shared goals, strengthened by team-building activities, events, and corporate celebrations. We focus on speed, ensuring quick adaptation and timely decisions, and prioritize creating value by constantly improving and innovating. We are driven by results, celebrating achievements and making a meaningful impact. At Mediacube, we grow, create, and succeed together.<br></p><p><strong>Sounds interesting, right? Then it's time to apply!</strong></p>",
        "logo": "logos/mediacube.png",
        "url": "https://www.remocate.app/jobs/backend-developer-13",
        "source": "remocate",
        "country": "🌎 World",
        "posted_at": "2026-01-31T13:18:20.520093"
    },
    {
        "title": "Wordpress Fullstack Developer",
        "company": "EfficientVision",
        "skills": [],
        "description": "<p>This is a remote position.</p><h3>Responsibilities:</h3><ul role=\"list\"><li>Develop and maintain WordPress websites from concept through deployment.<br></li><li>Build responsive, pixel-perfect websites from Figma designs.<br></li><li>Customize and extend themes using page builders such as Elementor.<br></li><li>Optimize websites for speed, performance, and SEO best practices.<br></li><li>Implement robust security measures and manage WordPress updates and backups.<br></li><li>Ensure websites are ADA-compliant and meet WCAG accessibility standards.<br></li><li>Configure and manage caching solutions (e.g., WP Rocket, W3TC).<br></li><li>Troubleshoot and debug issues across the front-end and back-end.<br></li><li>Collaborate with designers, content creators, and project managers.<br></li></ul><h3>Requirements</h3><ul role=\"list\"><li>Minimum 1 year of experience in WordPress development (full-stack).<br></li><li>Proficient in PHP, HTML, CSS, JavaScript, and REST API.<br></li><li>Extensive experience with Elementor and other major page builders.<br></li><li>Fair understanding of WordPress security, performance tuning, and caching.<br></li><li>Proven ability to create pixel-perfect layouts from Figma designs.<br></li><li>Experience with accessibility (ADA/WCAG) and responsive design.<br></li><li>Familiarity with tools like Git, cPanel, and deployment pipelines.</li></ul>",
        "logo": "logos/efficientvision.png",
        "url": "https://www.remocate.app/jobs/wordpress-fullstack-developer",
        "source": "remocate",
        "country": "🌎 World",
        "posted_at": "2026-01-24T13:18:25.035479"
    }
]